{
  "app": {
    "name": "Iframe",
    "short_description": "Вградете произволен уебсайт във вашия Zendesk (по-рано познато като приложението Sidebar Icon)",
    "long_description": "*iframe* представлява HTML елемент, който ви позволява да вложите една уеб страница в друга уеб страница.. Приложението Zendesk Iframe дава възможност на вашите консултанти бързо да преминават към външен уеб сайт и да се връщат към своите казуси, без да прекъсват работния си процес. Консултантите ви могат да разглеждат всеки външен сайт или източник на информация, например подробностите за поръчки или данни в друга система.\n\nПриложението Iframe показва външния източник като iframe във вашата сесия на Zendesk Support. Консултантите влизат в него чрез кликване върху иконата на Iframe.\n\nПриложението поддържа уеб сайтове, които включват [Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). За да научите повече, вижте [Iframes в Приложения](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps).\n\nЗа още информация относно настройката на приложението вижте тази [статия за приложението Iframe](https://support.zendesk.com/hc/en-us/articles/203660696).\n\nАко имате въпроси, изпратете имейл на [support@zendesk.com](mailto:support@zendesk.com).\n\nАктивирайки това приложение, вие приемате [Условията за ползване на приложения, създадени от Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Конфигурирайте приложението както следва и кликнете върху **Инсталиране**:\n\n* URL на Iframe: Линк към страницата, която искате да се покаже, когато консултантите кликнат върху иконата на приложението Iframe.\n* URL на иконата за неактивност: Изображение, което ще се използва, когато не взаимодействате с приложението.\n* URL на иконата при посочване: Изображение, което се появява, когато консултант постави курсора върху изображението.\n* URL на иконата за избран елемент: Изображение, което се използва, когато консултант кликне върху иконата на приложението.\n* Заглавие: Наименование на приложението.",
    "parameters": {
      "iframeURL": {
        "label": "URL на iframe"
      },
      "inactiveIconURL": {
        "label": "URL на неактивна икона"
      },
      "hoverIconURL": {
        "label": "URL на икона, появяваща се при посочване "
      },
      "selectedIconURL": {
        "label": "URL на избрана икона"
      },
      "zafSdkSupport": {
        "label": "Да се активира ли поддръжката на ZAF SDK?",
        "helpText": "Отметнете това квадратче, ако уебсайтът в iframe изисква поддръжка на ZAF SDK. Вижте темата „Iframes в приложения“ в документацията за разработчици."
      }
    },
    "description": "Вградете произволен уебсайт във вашия Zendesk (някога известно като приложение Sidebar Icon)"
  }
}
