{
  "app": {
    "name": "Iframe",
    "short_description": "Vložení libovolného webu do vašeho Zendesku (dříve Postranní panel s ikonou)",
    "long_description": "*iframe* je prvek HTML, který umožňuje vnořit jednu webovou stránku do jiné. Aplikace Iframe v rámci Zendesku umožňuje vašim agentům rychle přejít na externí web a potom se vrátit ke svým tiketům bez přerušení pracovního postupu. Vaši agenti si mohou vyvolat jakýkoli externí web a referenční informace, například detaily nebo data objednávky v jiném systému.\n\nAplikace Iframe zobrazí externí zdroj jako prvek iframe ve vaší instanci Zendesk Supportu. Vaši agenti mohou získat přístup k této stránce kliknutím na ikonu aplikace Iframe.\n\nAplikace Iframe podporuje weby, které obsahují  [SDK Zendesk App Framework (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Další informace najdete na stránce [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps).\n\nV tomto [článku o aplikaci Iframe](https://support.zendesk.com/hc/en-us/articles/203660696) najdete další informace o tom, jak aplikaci nainstalovat.\n\nDotazy prosím zasílejte na e-mailovou adresu [support@zendesk.com] (mailto:support@zendesk.com).\n\nTím, že zapnete tuto aplikaci, souhlasíte s [Podmínkami používání služby Vytvořeno společností Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Aplikaci níže uvedeným způsobem nakonfigurujte a pak klikněte na **Nainstalovat**:\n\n* URL prvku Iframe: Odkaz na stránku, která se má zobrazit, když agent klikne na ikonu aplikace Iframe.\n* URL ikony neaktivní aplikace: Obrázek, který se použije, když s aplikací nepracujete.\n* URL ikony zobrazené při najetí myši: Obrázek, který se použije, když agent najede myší na ikonu aplikace.\n* URL vybrané ikony: Obrázek, který se použije, když agent klikne na ikonu aplikace.\n* Titul: Název aplikace.",
    "parameters": {
      "iframeURL": {
        "label": "URL elementu iFrame"
      },
      "inactiveIconURL": {
        "label": "URL neaktivní ikony"
      },
      "hoverIconURL": {
        "label": "URL ikony zobrazené při najetí myši"
      },
      "selectedIconURL": {
        "label": "URL vybrané ikony"
      },
      "zafSdkSupport": {
        "label": "Zapnout podporu SDK ZAF?",
        "helpText": "Toto pole zaškrtněte, pokud web v elementu iframe vyžaduje podporu SDK ZAF. Viz téma „Iframes in Apps“ v naší dokumentaci pro vývojáře."
      }
    },
    "description": "Vložení libovolného webu do vašeho Zendesku (dříve Postranní panel s ikonou)"
  }
}
