{
  "app": {
    "name": "Iframe",
    "short_description": "Incruste cualquier sitio web en su cuenta de Zendesk (antes conocido como Icono de barra lateral)",
    "long_description": "Un *iframe* es un elemento HTML que permite incrustar una página web en otra página web. La aplicación Iframe de Zendesk permite que los agentes vayan fácilmente a un sitio web externo y luego regresen a sus tickets sin interrumpir el flujo de trabajo. Los agentes pueden buscar un sitio externo y consultar información, como detalles o datos del pedido, en otro sistema.\n\nLa aplicación Iframe presenta la fuente externa como un iframe en su cuenta de Zendesk Support. Los agentes pueden acceder a esta página haciendo clic en el icono de la aplicación Iframe.\n\nLa aplicación Iframe admite sitios web que incluyen el [SDK de Zendesk App Framework (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Mire [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) para obtener más información.\n\nConsulte este [artículo sobre la aplicación Iframe](https://support.zendesk.com/hc/en-us/articles/203660696) si desea más información sobre cómo configurar la aplicación.\n\nSi tiene preguntas, envíe correo electrónico a [support@zendesk.com](mailto:support@zendesk.com).\n\nAl activar esta aplicación, usted acepta los [Términos de uso de Creadas por Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configure la aplicación como sigue y luego haga clic en **Instalar**:\n\n* URL de Iframe: vínculo a la página que se mostrará cuando los agentes hagan clic en el icono de la aplicación Iframe.\n* URL de icono inactivo: imagen que se usará cuando no haya interacción con la aplicación.\n* URL de icono flotante: imagen que se cambiará cuando un agente pase el mouse por encima de la imagen.\n* URL de icono seleccionado: imagen que se usará cuando un agente haga clic en el icono de la aplicación.\n* Título: nombre de la aplicación.",
    "parameters": {
      "iframeURL": {
        "label": "URL de Iframe"
      },
      "inactiveIconURL": {
        "label": "URL de icono inactivo"
      },
      "hoverIconURL": {
        "label": "URL de icono flotante"
      },
      "selectedIconURL": {
        "label": "URL de icono seleccionado"
      },
      "zafSdkSupport": {
        "label": "¿Desea activar el soporte de SDK para ZAF?",
        "helpText": "Marque esta casilla si el sitio web con Iframe requiere soporte de SDK para ZAF. Consulte el tema \"Iframes in Apps\" (Iframe en aplicaciones) en la documentación para desarrolladores."
      }
    },
    "description": "Incruste sitio web en su cuenta de Zendesk (antes Icono de barra lateral)"
  }
}
