{
  "app": {
    "name": "Iframe",
    "short_description": "Upota mikä vain Internet-sivusto Zendeskiin (aiemmin nimellä: Sivupalkin kuvake -sovellus)",
    "long_description": "*iframe* on HTML-elementti, jolla voit upottaa verkkosivun toisen verkkosivun sisään. Zendesk Iframe sovelluksella tukihenkilöt voivat siirtyä nopeasti ulkoiselle verkkosivulle ja palata sitten tiketteihin keskeyttämättä työnkulkua. Tukihenkilöt voivat tarkistaa ulkoisia verkkosivuja ja viitetietoja, kuten tilauksen tietoja tai muuta vastaavaa toisesta järjestelmästä.\n\nIframe-sovellus esittää ulkoisen lähteen iframena Zendesk Support -istunnossa. Tukihenkilöt voivat avata kyseisen sivun napsauttamalla Iframe-sovelluksen kuvaketta.\n\nIframe-sovellus tukee verkkosivuja, joita ovat muun muassa [Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). Katso kohtaa [Iframet sovelluksissa](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps), jos haluat lisätietoa.\n\nLue tästä [Iframe-sovellusartikkeli](https://support.zendesk.com/hc/en-us/articles/203660696) lisätietoa sovelluksen määrittämisestä.\n\nJos sinulla on kysyttävää, lähetä sähköpostia osoitteella [support@zendesk.com](mailto:support@zendesk.com).\n\nOttamalla tämän sovelluksen käyttöön, hyväksyt [Zendeskin kehittämä -käyttöehdot](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Määritä sovellus seuraavasti ja napsauta sitten **Asenna**:\n\n* Iframe-URL: Linkki sivulle, jonka haluat tuoda esiin, kun tukihenkilöt napsauttavat Iframe-sovelluksen kuvaketta.\n* Käyttämättömän kuvakkeen URL: Kuva, jota käytetään, kun et käytä sovellusta.\n* Osoitettavan kuvakkeen URL: Kuva, johon vaihdetaan, kun tukihenkilö pitää hiirtä kuvan päällä.\n* Valitun kuvakkeen URL: Kuva, jota käytetään, kun tukihenkilö napsauttaa sovelluksen kuvaketta.\n* Otsikko: Sovelluksen nimi.",
    "parameters": {
      "iframeURL": {
        "label": "iframe-URL"
      },
      "inactiveIconURL": {
        "label": "Käyttämättömän kuvakkeen URL"
      },
      "hoverIconURL": {
        "label": "Osoitettavan kuvakkeen URL"
      },
      "selectedIconURL": {
        "label": "Valitun kuvakkeen URL"
      },
      "zafSdkSupport": {
        "label": "Otetaanko ZAF SDK -tuki käyttöön?",
        "helpText": "Valitse tämä ruutu, jos iframe-sivusto vaatii ZAF SDK -tukea.  Katso ohjelmoijan dokumentaatiosta kohtaa \"Iframet sovelluksissa\"."
      }
    },
    "description": "Upota mikä vain Internet-sivusto Zendeskiin (aiemmin nimellä: Sivupalkin kuvake -sovellus)"
  }
}
