{
  "app": {
    "name": "Iframe",
    "short_description": "Intégrez un site dans votre Zendesk (autrefois : application Icône de barre latérale)",
    "long_description": "Un *iframe* est un élément HTML qui vous permet d’imbriquer une page Web dans une autre page Web. L’application Iframe de Zendesk permet aux agents de rapidement accéder à un site Web externe et de retourner à leurs tickets sans interrompre leur workflow. Vos agents peuvent consulter n’importe quel site externe et n’importe quelles informations de référence, comme les détails ou les données d’une commande, sur un autre système.\n\nL’application Iframe présente la source externe comme un iframe dans votre instance Zendesk Support. Vos agents peuvent accéder à cette page en cliquant sur l’icône de l’application Iframe.\n\nL’application Iframe prend en charge des sites Web qui sont dotés du [Framework SDK des applications Zendesk (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). Consultez [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) pour en savoir plus.\n\nConsultez cet [article sur l’application Iframe](https://support.zendesk.com/hc/en-us/articles/203660696) pour en savoir plus sur la configuration de l’application.\n\nSi vous avez des questions, envoyez un message à [support@zendesk.com](mailto:support@zendesk.com).\n\nEn activant cette application, vous acceptez les [Conditions d’utilisation Créées par Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configurez l’application comme suit, puis cliquez sur **Installer** :\n\n* URL Iframe : le lien vers la page que vous souhaitez afficher quand les agents cliquent sur l’icône de l’application Iframe.\n* URL d’icône inactive : l’image qui sera utilisée quand vous n’interagissez pas avec l’application.\n* URL d’icône de survol : l’image qui s’affichera quand un agent survole l’image avec sa souris.\n* URL d’icône sélectionnée : l’image qui sera utilisée quand un agent clique sur l’icône de l’application.\n* Titre : le nom de l’application.",
    "parameters": {
      "iframeURL": {
        "label": "URL iFrame"
      },
      "inactiveIconURL": {
        "label": "URL d’icône inactive"
      },
      "hoverIconURL": {
        "label": "URL d’icône de survol"
      },
      "selectedIconURL": {
        "label": "URL d’icône sélectionnée"
      },
      "zafSdkSupport": {
        "label": "Activer la prise en charge du SDK ZAF ?",
        "helpText": "Cochez cette case si le site Web de l’iFrame nécessite la prise en charge du SDK ZAF. Consultez l’article « Iframes in Apps » (iFrame dans les applications) dans notre documentation destinée aux développeurs."
      }
    },
    "description": "Intégrez un site dans votre Zendesk (autrefois : application Icône de barre latérale)"
  }
}
