{
  "app": {
    "name": "Iframe",
    "short_description": "Incorpora qualsiasi sito web in Zendesk (app prima chiamata Icona nella barra laterale)",
    "long_description": "Un *iframe* è un elemento HTML che permette di incorporare una pagina web in un’altra. L’app Zendesk Iframe consente agli agenti di passare rapidamente a un sito web esterno e in seguito di tornare ai ticket senza interrompere il proprio workflow. Gli agenti possono cercare informazioni e riferimenti su qualunque sito esterno, ad esempio dettagli sugli ordini o altri dati su un sistema separato.\n\nL’app Iframe presenta la fonte esterna come iframe in Zendesk Support. Gli agenti possono accedere a questa pagina facendo clic sull’icona dell’app Iframe.\n\nL’app Iframe supporta siti web che includono l’[SDK per framework di applicazioni Zendesk (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Per maggiori informazioni, dai un’occhiata all’articolo [Iframe nelle app](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps).\n\nPer ulteriori indicazioni riguardanti la configurazione dell’app, leggi questo [articolo sull’app Iframe](https://support.zendesk.com/hc/en-us/articles/203660696).\n\nIn caso di domande, invia una email a [support@zendesk.com](mailto:support@zendesk.com).\n\nAttivando l’app, accetti i [Termini di utilizzo per le app create da Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configura l’app come segue, quindi fai clic su **Installa**.\n\n* URL Iframe: link alla pagina da visualizzare quando gli agenti fanno clic sull'icona dell’app Iframe.\n* URL icona disattivata: immagine usata quando non si interagisce con l’app.\n* URL icona passaggio del mouse: immagine che viene sostituita quando l’agente passa il cursore del mouse sull’immagine.\n* URL icona selezionata: immagine usata quando un agente fa clic sull’icona dell’app.\n* Titolo: il nome dell’app.",
    "parameters": {
      "iframeURL": {
        "label": "URL iframe"
      },
      "inactiveIconURL": {
        "label": "URL icona disattivata"
      },
      "hoverIconURL": {
        "label": "URL icona passaggio del mouse"
      },
      "selectedIconURL": {
        "label": "URL icona selezionata"
      },
      "zafSdkSupport": {
        "label": "Attiva supporto ZAF SDK",
        "helpText": "Se il sito web da incorporare con iframe richiede il supporto ZAF SDK, seleziona questa casella. Consulta l’argomento “Iframes in Apps” (Uso di iframe nelle app) nella nostra documentazione per sviluppatori."
      }
    },
    "description": "Incorpora qualsiasi sito web in Zendesk (app prima chiamata Icona nella barra laterale)."
  }
}
