{
  "app": {
    "name": "Iframe",
    "short_description": "Maak een pictogram en voeg elke website toe aan uw Zendesk",
    "long_description": "Een *iframe* is een HTML-element waarmee u een webpagina in een andere webpagina kunt nesten. Met de Zendesk-app Iframe kunnen uw agenten snel naar een externe website navigeren en daarna terugkeren naar hun tickets zonder hun workflow te onderbreken. Uw agenten kunnen elke externe site en naslaginformatie op een ander systeem raadplegen, zoals ordergegevens of andere gegevens.\n\nDe app Iframe presenteert de externe bron als een iframe in uw exemplaar van Zendesk Support. Uw agenten hebben toegang tot deze pagina door op het pictogram voor de app Iframe te klikken.\n\nDe app Iframe ondersteunt websites met het [Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). Ga naar [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) voor meer informatie.\n\nZie dit [artikel over Iframe-app](https://support.zendesk.com/hc/en-us/articles/203660696) voor meer informatie over het instellen van de app.\n\nStuur bij vragen een e-mail naar [support@zendesk.com](mailto:support@zendesk.com).\n\nDoor deze app in te schakelen, gaat u akkoord met de [Gebruiksvoorwaarden van Gemaakt door Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configureer de app als volgt en klik op klik op **Installeren**:\n\n* Webadres voor Iframe: breng een koppeling aan naar de pagina die u wilt laten weergeven als agenten op het pictogram voor de app Iframe klikken.\n* Webadres voor niet-actief pictogram: afbeelding die wordt gebruikt als u niet met de app bezig bent.\n* Webadres voor zwevend pictogram: afbeelding die wordt gewisseld als een agent de muisaanwijzer boven de afbeelding houdt.\n* Webadres voor geselecteerd pictogram: afbeelding die wordt gebruikt als een agent op het pictogram voor de app klikt.\n* Titel: naam van de toepassing.",
    "parameters": {
      "iframeURL": {
        "label": "Webadres voor iframe"
      },
      "inactiveIconURL": {
        "label": "Webadres voor niet-actief pictogram"
      },
      "hoverIconURL": {
        "label": "Webadres voor zwevend pictogram"
      },
      "selectedIconURL": {
        "label": "Webadres voor geselecteerd pictogram"
      },
      "zafSdkSupport": {
        "label": "ZAF SDK-support inschakelen?",
        "helpText": "Schakel dit vakje in als voor de iframe-website ZAF SDK-support is vereist. Zie het onderwerp 'Iframes in apps' in onze documentatie voor ontwikkelaars."
      }
    },
    "description": "Maak een pictogram en voeg elke website toe aan uw Zendesk"
  }
}
