{
  "app": {
    "name": "Iframe",
    "short_description": "Osadź wybraną witrynę internetową na koncie Zendesk (poprzednia nazwa aplikacji: Ikona menu bocznego)",
    "long_description": "Ramka *iframe* to element HTML umożliwiający zagnieżdżenie jednej strony internetowej w drugiej. Aplikacja Zendesk Iframe umożliwia agentom szybkie przechodzenie do zewnętrznej witryny internetowej i powrót do zgłoszeń bez zakłócania przebiegu pracy. Agenci mogą wyszukiwać informacje w dowolnej witrynie zewnętrznej i korzystać z materiałów referencyjnych, takich jak szczegóły zamówień czy dane przechowywane w innym systemie.\n\nAplikacja Iframe prezentuje źródło zewnętrzne jako ramkę iframe w Zendesk Support. Agenci mogą uzyskiwać dostęp do tej strony, klikając ikonę aplikacji Iframe.\n\nAplikacja Iframe obsługuje witryny internetowe zawierające [zestaw Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). Aby uzyskać więcej informacji, zobacz [Ramki iframe w aplikacjach](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps).\n\nAby uzyskać więcej informacji na temat konfigurowania tej aplikacji, zobacz [artykuł dotyczący aplikacji Iframe](https://support.zendesk.com/hc/en-us/articles/203660696).\n\nW razie pytań napisz e-mail na adres [support@zendesk.com](mailto:support@zendesk.com).\n\nWłączając tę aplikację, wyrażasz zgodę na [Warunki użytkowania dotyczące aplikacji opracowanej przez Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Skonfiguruj aplikację zgodnie z poniższym opisem, a następnie kliknij przycisk **Zainstaluj**:\n\n* Adres URL aplikacji Iframe — łącze do strony, która ma być wyświetlana, kiedy agenci klikną ikonę menu aplikacji Iframe.\n* Adres URL ikony nieaktywności — obraz wyświetlany, kiedy nie korzystasz z aplikacji.\n* Adres URL ikony pod wskaźnikiem myszy — obraz wyświetlany, kiedy agent zatrzyma wskaźnik myszy na ikonie aplikacji.\n* Adres URL wybranej ikony — obraz wyświetlany, kiedy agent kliknie ikonę aplikacji.\n* Tytuł — nazwa aplikacji.",
    "parameters": {
      "iframeURL": {
        "label": "Adres URL iframe"
      },
      "inactiveIconURL": {
        "label": "Adres URL nieaktywnej ikony"
      },
      "hoverIconURL": {
        "label": "Adres URL ikony pod kursorem"
      },
      "selectedIconURL": {
        "label": "Adres URL wybranej ikony"
      },
      "zafSdkSupport": {
        "label": "Włączyć obsługę zestawu ZAF SDK?",
        "helpText": "Zaznacz to pole, jeśli witryna osadzona przy użyciu ramki iframe wymaga obsługi zestawu ZAF SDK. Zobacz temat „Iframes in Apps” („Ramki iframe w aplikacjach”) w naszej dokumentacji dla deweloperów."
      }
    },
    "description": "Osadź wybraną witrynę internetową na koncie Zendesk (uprzednia nazwa: Ikona menu bocznego)"
  }
}
