{
  "app": {
    "name": "Iframe",
    "short_description": "Incorpore qualquer site em seu Zendesk (conhecido anteriormente como o aplicativo Ícone da barra lateral)",
    "long_description": "Uma *iframe* é um elemento HTML que permite aninhar uma página da web em outra. O aplicativo Iframe do Zendesk permite que seus agentes naveguem rapidamente para um site externo e, em seguida, retornem para seus tickets sem interromper o fluxo de trabalho. Os agentes podem pesquisar em qualquer site externo e fazer referência a informações como detalhes de pedido e dados em outro sistema.\n\nO aplicativo Iframe apresenta a fonte externa como uma iframe na sua instância do Zendesk Support. Os agentes podem acessar essa página clicando no ícone do aplicativo Iframe.\n\nO aplicativo Iframe é compatível com sites que incluem o [SDK da Zendesk App Framework (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Consulte [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) para saber mais.\n\nLeia este [artigo sobre o aplicativo Iframe](https://support.zendesk.com/hc/en-us/articles/203660696) para obter mais informações sobre como configurar o aplicativo.\n\nSe tiver dúvidas, envie um email para [support@zendesk.com](mailto:support@zendesk.com).\n\nAo ativar o aplicativo, Você concorda com [os Termos de Uso do Built by Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configure o aplicativo da seguinte maneira e clique em **Instalar**:\n\n* URL do Iframe: link para a página que você deseja exibir quando os agentes clicarem no ícone do aplicativo Iframe.\n* URL do ícone inativo: imagem que será usada quando você não estiver interagindo com o aplicativo.\n* URL do ícone de passagem do mouse: imagem que será convertida quando um agente passar o mouse sobre a imagem.\n* URL do ícone selecionado: imagem que será usada quando um agente clicar no ícone do aplicativo.\n* Título: nome do aplicativo.",
    "parameters": {
      "iframeURL": {
        "label": "URL da iFrame"
      },
      "inactiveIconURL": {
        "label": "URL do ícone inativo"
      },
      "hoverIconURL": {
        "label": "URL do ícone de passagem do mouse"
      },
      "selectedIconURL": {
        "label": "URL do ícone selecionado"
      },
      "zafSdkSupport": {
        "label": "Habilitar suporte a SDK ZAF?",
        "helpText": "Marque essa caixa se o site com iFrame precisar de suporte a SDK ZAF. Consulte o tópico iFrames em aplicativos na nossa documentação do desenvolvedor."
      }
    },
    "description": "Incorpore qualquer site em seu Zendesk (conhecido anteriormente como o aplicativo Ícone da barra lateral)"
  }
}
