{
  "app": {
    "name": "iFrame",
    "short_description": "Încorporați orice site web în contul dumneavoastră Zendesk (cunoscută anterior drept aplicația Pictograma Bară laterală)",
    "long_description": "Un *iframe* este un element HTML care vă permite să imbricați o pagină web într-o altă pagină web. Aplicația iFrame Zendesk permite agenților să navigheze rapid către un site web extern și apoi să revină la tichete, fără a-și întrerupe fluxul de lucru. Agenții pot accesa orice site extern și pot consulta informații, cum ar fi detaliile comenzii sau datele privind un alt sistem.\n\nAplicația iFrame prezintă sursa externă drept o componentă iFrame într-o pagină separată din contul Zendesk Support. Agenții pot accesa această pagină făcând clic pe pictograma aplicației iFrame.\n\nAplicația iFrame acceptă site-uri care includ [SDK pentru Zendesk App Framework (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Consultați [iFrame în aplicații](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) pentru a afla mai multe.\n\nCitiți acest [articol despre aplicația iFrame](https://support.zendesk.com/hc/en-us/articles/203660696) pentru mai multe informații despre configurarea aplicației.\n\nPentru orice întrebări, vă rugăm să trimiteți un e-mail la [support@zendesk.com](mailto:support@zendesk.com).\n\nActivând această aplicație, sunteți de acord cu [Termenii de utilizare pentru produsele desemnate prin „Conceput de Zendesk”] (https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Configurați aplicația după cum urmează, apoi faceți clic pe **Instalare**:\n\n* Adresă URL iFrame: Link-ul către pagina care doriți să se afișeze atunci când agenții fac clic pe pictograma aplicației iFrame.\n* Adresă URL pictogramă inactivă: Imaginea care se va utiliza atunci când nu interacționați cu aplicația.\n* Adresă URL pictogramă de trecere: Imaginea care se va interschimba atunci când un agent trece cu cursorul peste imagine.\n* Adresă URL pictogramă selectată: Imaginea care se va utiliza atunci când un agent face clic pe pictograma aplicației.\n* Titlu: Numele aplicației.",
    "parameters": {
      "iframeURL": {
        "label": "Adresă URL iFrame"
      },
      "inactiveIconURL": {
        "label": "Adresă URL pictogramă inactivă"
      },
      "hoverIconURL": {
        "label": "Adresă URL pictogramă de trecere"
      },
      "selectedIconURL": {
        "label": "Adresă URL pictogramă selectată"
      },
      "zafSdkSupport": {
        "label": "Activați asistența ZAF SDK?",
        "helpText": "Bifați această casetă dacă site-ul web care utilizează iFrame necesită asistență ZAF SDK. Consultați subiectul „Iframes in Apps” (Elemente iFrame în aplicații) în documentația noastră pentru dezvoltatori."
      }
    },
    "description": "Încorporați orice site web în contul dumneavoastră Zendesk (cunoscută anterior drept aplicația Pictograma Bară laterală)"
  }
}
