{
  "app": {
    "name": "Iframe",
    "short_description": "Встройте любой веб-сайт в свою службу Zendesk (ранее — приложение «Значок боковой панели»)",
    "long_description": "*Iframe* - это элемент HTML, который позволяет вкладывать одну веб-страницу в другую. Приложение Zendesk Iframe позволяет агентам быстро переходить на внешний веб-сайт, а затем возвращаться к тикетам, не прерывая работы. Агенты смогут обращаться к любому внешнему сайту и справочной информации, такой как данные заказов или данные из другой системы.\n\nПриложение Iframe представляет внешний источник в виде элемента iframe в вашей копии Zendesk Support. Для доступа к этой странице агентам достаточно щелкнуть значок приложения Iframe.\n\nПриложение Iframe поддерживает веб-сайты, на которых установлен [SDK для среды разработки приложений Zendesk (ZAF)](https://github.com/zendesk/zendesk_app_framework_sdk). Подробнее об этом см. раздел [Iframe в приложениях](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps).\n\nО настройке приложения можно узнать в этой [статье о приложении Iframe](https://support.zendesk.com/hc/en-us/articles/203660696).\n\nС вопросами обращайтесь по адресу [support@zendesk.com](mailto:support@zendesk.com).\n\nАктивируя это приложение, вы принимаете [Условия пользования продуктами Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Задайте следующие параметры приложения и нажмите кнопку **Установить **:\n\n* Iframe URL: ссылка на страницу, которая должна открываться, когда агент щелкает значок приложения Iframe.\n* URL неактивного значка: изображение, применяемое, когда пользователь не работает с приложением.\n* URL значка при наведении: изображение, которое появляется, когда агент наводит на значок указатель мыши.\n* URL выбранного значка: изображение, которое появляется, когда агент щелкает значок приложения.\n* Заголовок: название приложения.",
    "parameters": {
      "iframeURL": {
        "label": "iFrame URL"
      },
      "inactiveIconURL": {
        "label": "URL неактивного значка"
      },
      "hoverIconURL": {
        "label": "URL значка при наведении"
      },
      "selectedIconURL": {
        "label": "URL выбранного значка"
      },
      "zafSdkSupport": {
        "label": "Включить поддержку ZAF SDK?",
        "helpText": "Установите этот флажок, если для веб-сайта в iFrame требуется поддержка ZAF SDK. См. раздел документации разработчика «iFrame в приложениях»."
      }
    },
    "description": "Встройте любой веб-сайт в свою службу Zendesk"
  }
}
