{
  "app": {
    "name": "Iframe",
    "short_description": "Bädda in en valfri webbplats i din Zendesk (appen kallades tidigare Sidopanelikon)",
    "long_description": "En *iframe* är ett HTML-element som ger dig möjlighet att kapsla in en webbsida i en annan webbsida. Zendesk-appen Iframe ger dina agenter möjlighet att navigera snabbt till en extern webbplats och sedan gå tillbaka till sina ärenden utan att störa arbetsflödet. Dina agenter kan söka efter valfria externa platser och referensinformation som beställningsuppgifter eller -data i ett annat system.\n\nAppen Iframe presenterar den externa källan som en iframe i din Zendesk Support-instans. Dina agenter kan nå denna sida genom att klicka på Iframe-appens ikon.\n\nAppen Iframe stödjer webbplatser som omfattar [Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk). Ta en titt på [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) om du vill ha mer information.\n\nDenna [artikel om appen Iframe](https://support.zendesk.com/hc/en-us/articles/203660696) innehåller mer information om hur man konfigurerar appen.\n\nSkicka eventuella frågor till [support@zendesk.com](mailto:support@zendesk.com).\n\nNär du använder denna app innebär det att du samtycker till [användningsvillkoren för Built by Zendesk](https://www.zendesk.com/company/built-by-zendesk-agmt/).",
    "installation_instructions": "Konfigurera appen på följande sätt och klicka sedan på **Installera**:\n\n Iframe-webbadress: Länka till den sida du vill visa när agenter klickar på Iframe-appens ikon.\n* Webbadress för inaktiv ikon: Bild som kommer att användas när du inte arbetar med appen.\n* Webbadress för hovrad ikon: Bild som kommer att bytas ut när en agent hovrar över bilden.\n* Webbadress för vald ikon: Bild som kommer att användas ut när en agent klickar på appens ikon.\n* Titel: Appens namn.",
    "parameters": {
      "iframeURL": {
        "label": "iframe-webbadress"
      },
      "inactiveIconURL": {
        "label": "Webbadress för inaktiv ikon"
      },
      "hoverIconURL": {
        "label": "Webbadress för hovrad ikon"
      },
      "selectedIconURL": {
        "label": "Webbadress för vald ikon"
      },
      "zafSdkSupport": {
        "label": "Vill du aktivera stöd för ZAF SDK?",
        "helpText": "Markera denna ruta om den iFrame-inbäddade webbplatsen kräver stöd för ZAF SDK. Sök efter ämnet ”Iframes in Apps” (iFrame i appar) i vår dokumentation för programutvecklare."
      }
    },
    "description": "Bädda in en valfri webbplats i din Zendesk (appen kallades tidigare Sidopanelikon)"
  }
}
