{
  "app": {
    "name": "Iframe",
    "short_description": "Zendesk'inize bir site gömün (eski adıyla, Yan Çubuk Simgesi uygulaması)",
    "long_description": "*iframe*, bir web sayfasını başka bir web sayfasının içine yerleştirmenize izin veren bir HTML öğesidir. Temsilcileriniz, Zendesk Iframe uygulaması sayesinde iş akışlarını kesintiye uğratmadan harici bir web sitesine hızlı bir şekilde gidip sonra kayıtlarına dönebilirler. Temsilcileriniz başka bir sistemde sipariş ayrıntıları veya verileri gibi harici site ve referans bilgilerini arayabilir.\n\nIframe uygulaması, harici kaynağı Zendesk Support kurulumunuzda bir iframe olarak sunar. Temsilcileriniz Iframe uygulama simgesine tıklayarak bu sayfaya erişebilir.\n\nIframe uygulaması, [Zendesk App Framework (ZAF) SDK](https://github.com/zendesk/zendesk_app_framework_sdk) içeren web sitelerini destekler. Daha fazla bilgi edinmek için [Iframes in Apps](https://developer.zendesk.com/apps/docs/agent/iframes_in_apps) konusunu inceleyin.\n\nUygulamanın nasıl kurulacağı hakkında daha fazla bilgi için bu [Iframe uygulama makalesine](https://support.zendesk.com/hc/en-us/articles/203660696) bakın.\n\nSorularınız için lütfen [support@zendesk.com](mailto:support@zendesk.com) adresine e-posta gönderin.\n\nBu uygulamayı etkinleştirerek, [Built by Zendesk Kullanım Koşulları](https://www.zendesk.com/company/built-by-zendesk-agmt/)'nı kabul edersiniz.",
    "installation_instructions": "Uygulamayı aşağıdaki gibi yapılandırıp **Kur**a tıklayın:\n\n* Iframe URL'si: Temsilciler Iframe uygulama simgesine tıkladığında görüntülenmesini istediğiniz sayfanın bağlantısı.\n* Etkin Olmayan Simge URL'si: Uygulamayla etkileşim halinde olmadığınız zaman kullanılacak resim.\n* Vurgu Simgesi URL'si: Temsilci resmin üzerine geldiğinde yerine gelecek olan resim.\n* Seçilen Simge URL'si: Temsilci uygulama simgesine tıkladığında kullanılacak olan resim.\n* Başlık: Uygulamanın adı.",
    "parameters": {
      "iframeURL": {
        "label": "iframe URL"
      },
      "inactiveIconURL": {
        "label": "Etkin değil simgesi için URL"
      },
      "hoverIconURL": {
        "label": "Vurgu simgesi için URL"
      },
      "selectedIconURL": {
        "label": "Seçili simgesi için URL"
      },
      "zafSdkSupport": {
        "label": "ZAF SDK desteği etkinleştirilsin mi?",
        "helpText": "Iframe ile gömülen web sitesi için ZAF SDK desteği gerekiyorsa bu kutuyu işaretleyin. Geliştirici belgelerimizde yer alan \"Iframes in Apps\" (Uygulamalarda Iframe) konu başlığına bakın."
      }
    },
    "description": "Zendesk'inize bir site gömün (eski adıyla, Yan Çubuk Simgesi uygulaması)"
  }
}
